#include <stdio.h>

int main() {
    // พิมพ์ค่า 'a' ออกมา โดยกำหนดให้มีทศนิยม 3 ตำแหน่ง และจองพื้นที่ทั้งหมด 6 ตัวอักษร
    printf("a=%6.3f%%\n", 0.617);

    // พิมพ์ค่า 'b' ออกมาเป็นเลขจำนวนเต็ม 4 หลัก ถ้าไม่ถึงจะเติมเลขศูนย์ข้างหน้า และมีสัญลักษณ์เปอร์เซ็นต์ต่อท้าย
    printf("b=%4d%%\n", 25);

    // พิมพ์ค่า 'c' ออกมาเป็นตัวเลขทศนิยม 3 ตำแหน่ง โดยจัดชิดซ้าย และเว้นวรรคให้ครบ 6 ตัวอักษร
    printf("c  =%6.3f%%\n", 19);

    // พิมพ์ค่า 'd' ออกมาเป็นเลขจำนวนเต็ม 2 หลัก โดยจัดชิดซ้าย และมีสัญลักษณ์เปอร์เซ็นต์ต่อท้าย
    printf("d =%-2d%%\n", 9);

    // พิมพ์ค่า 'e' ออกมาเป็นตัวเลขทศนิยม 3 ตำแหน่ง โดยจัดชิดซ้าย และจองพื้นที่ทั้งหมด 7 ตัวอักษร
    printf("e=%-7.3f%%\n", 124.555);

    // พิมพ์ค่า 'f' ออกมาเป็นตัวเลขทศนิยม 3 ตำแหน่ง โดยจัดชิดซ้าย และจองพื้นที่ทั้งหมด 5 ตัวอักษร
    printf("f=%-5.3f%%\n", 0.001);

    return 0; // โปรแกรมทำงานเสร็จสิ้น และส่งค่ากลับเป็น 0
}